articles/pytorch-and-python-free-threading/wrk-leopard-01-gil.txt
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 30s test @ http://dgx:4444/generate/The%20quick%20brown%20fox?max_length=20&device=cuda&seed=42
  14 threads and 14 connections
  Thread Stats   Min      Avg       Stdev     Max     +/- Stdev
    Latency     1.11s     1.46s    92.76ms   1.82s    84.47%
    Req/Sec     0.00      0.00      0.00     0.00    100.00%
  Latency Distribution
      0%    1.11s
      1%    1.16s
      2%    1.22s
      3%    1.24s
      4%    1.29s
      5%    1.36s
      6%    1.37s
      7%    1.37s
      8%    1.37s
      9%    1.38s
     10%    1.38s
     11%    1.39s
     12%    1.39s
     13%    1.39s
     14%    1.40s
     15%    1.40s
     16%    1.40s
     17%    1.41s
     18%    1.41s
     19%    1.41s
     20%    1.41s
     21%    1.41s
     22%    1.41s
     23%    1.42s
     24%    1.42s
     25%    1.42s
     26%    1.42s
     27%    1.42s
     28%    1.42s
     29%    1.42s
     30%    1.42s
     31%    1.43s
     32%    1.43s
     33%    1.43s
     34%    1.43s
     35%    1.43s
     36%    1.43s
     37%    1.43s
     38%    1.44s
     39%    1.44s
     40%    1.44s
     41%    1.44s
     42%    1.44s
     43%    1.45s
     44%    1.45s
     45%    1.45s
     46%    1.45s
     47%    1.45s
     48%    1.45s
     49%    1.45s
     50%    1.46s
     51%    1.46s
     52%    1.46s
     53%    1.46s
     54%    1.46s
     55%    1.47s
     56%    1.47s
     57%    1.47s
     58%    1.47s
     59%    1.47s
     60%    1.47s
     61%    1.48s
     62%    1.48s
     63%    1.48s
     64%    1.48s
     65%    1.48s
     66%    1.49s
     67%    1.49s
     68%    1.49s
     69%    1.49s
     70%    1.49s
     71%    1.49s
     72%    1.49s
     73%    1.50s
     74%    1.50s
     75%    1.50s
     76%    1.50s
     77%    1.50s
     78%    1.51s
     79%    1.51s
     80%    1.51s
     81%    1.51s
     82%    1.51s
     83%    1.51s
     84%    1.52s
     85%    1.52s
     86%    1.52s
     87%    1.53s
     88%    1.53s
     89%    1.53s
     90%    1.54s
     91%    1.55s
     92%    1.56s
     93%    1.56s
     94%    1.59s
     95%    1.59s
     96%    1.60s
     97%    1.70s
     98%    1.75s
     99%    1.77s
    100%    1.82s
  221 requests in 30.07s, 129.42KB read
  Socket errors: connect 0, read 0, write 0, timeout 60
Requests/sec:      7.35
Transfer/sec:      4.30KB