articles/pytorch-and-python-free-threading/wrk-leopard-02-no-gil.txt
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 30s test @ http://dgx:4444/plaintext
  14 threads and 14 connections
  Thread Stats   Min      Avg       Stdev     Max     +/- Stdev
    Latency   127.00us   11.68ms   55.98ms 818.74ms   94.91%
    Req/Sec    20.00      4.89k     1.46k    6.43k    87.86%
  Latency Distribution
      0%  127.00us
      1%  148.00us
      2%  150.00us
      3%  152.00us
      4%  153.00us
      5%  154.00us
      6%  155.00us
      7%  156.00us
      8%  157.00us
      9%  157.00us
     10%  158.00us
     11%  159.00us
     12%  159.00us
     13%  160.00us
     14%  161.00us
     15%  161.00us
     16%  162.00us
     17%  162.00us
     18%  163.00us
     19%  163.00us
     20%  164.00us
     21%  165.00us
     22%  165.00us
     23%  166.00us
     24%  166.00us
     25%  167.00us
     26%  167.00us
     27%  168.00us
     28%  168.00us
     29%  169.00us
     30%  169.00us
     31%  170.00us
     32%  170.00us
     33%  171.00us
     34%  171.00us
     35%  172.00us
     36%  172.00us
     37%  173.00us
     38%  173.00us
     39%  174.00us
     40%  174.00us
     41%  175.00us
     42%  175.00us
     43%  176.00us
     44%  176.00us
     45%  177.00us
     46%  178.00us
     47%  178.00us
     48%  179.00us
     49%  179.00us
     50%  180.00us
     51%  181.00us
     52%  181.00us
     53%  182.00us
     54%  183.00us
     55%  183.00us
     56%  184.00us
     57%  185.00us
     58%  186.00us
     59%  186.00us
     60%  187.00us
     61%  188.00us
     62%  189.00us
     63%  190.00us
     64%  191.00us
     65%  192.00us
     66%  193.00us
     67%  194.00us
     68%  195.00us
     69%  196.00us
     70%  197.00us
     71%  198.00us
     72%  199.00us
     73%  200.00us
     74%  202.00us
     75%  203.00us
     76%  205.00us
     77%  207.00us
     78%  208.00us
     79%  211.00us
     80%  213.00us
     81%  216.00us
     82%  219.00us
     83%  223.00us
     84%  229.00us
     85%  236.00us
     86%  246.00us
     87%  263.00us
     88%  308.00us
     89%  599.00us
     90%    8.77ms
     91%   19.48ms
     92%   30.74ms
     93%   42.55ms
     94%   54.97ms
     95%   68.92ms
     96%   85.23ms
     97%  106.42ms
     98%  139.96ms
     99%  282.83ms
    100%  462.36ms
  1970103 requests in 30.01s, 420.86MB read
Requests/sec:  65652.68
Transfer/sec:     14.02MB